H_A_R_D/hard.tex
% Created 2019-04-19 Fri 11:48
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Daiwei Chen}
\date{\today}
\title{\textbf{H A R D}\\\medskip
\large It's too hard.}
\hypersetup{
 pdfauthor={Daiwei Chen},
 pdftitle={\textbf{H A R D}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Hard Problems}
\label{sec:orga2400a8}
Many problems have polynomial \(O(n^k)\) time solutions.
Some problems haven't had a polynomial time solution.

\section{Complexity Classes}
\label{sec:org8a47dfa}
\begin{description}
\item[{P}] Set of problems we can solve in polynomial time. Sorting, Searching\ldots{}
\item[{NP}] Verifiable in polynomial time. If you can solve in polynomial time, you can verify in polynomial time, but it's not always true in the other direction.
\item[{NP-Complete}] Set of problems that \uline{ANY} problem in NP can be transformed into in polynomial time. Decision.
\item[{NP-Hard}] At least as hard as hard as hard as hard as any problem in NP. Optimization.
\end{description}

\section{P vs NP}
\label{sec:org58fef01}
P = NP? If you can find a polynomial solution in NP-Complete, then you can transform any NP problem into NP-Complete in polynomial time and then solve it. So if you can prove P = NP you're a genius millionare.

\section{NP-Complete Problems}
\label{sec:orgab0c260}
\subsection{Boolean Satisfiability}
\label{sec:org7cfea6f}
kCNF (k Conjunctive Normal Form) - A way to express a logical statement. Each or has exactly k variables.
\begin{itemize}
\item "AND" of many "OR" expressions, each of which contains K variables or their negations.
\item (P || !Q) \&\& (R || Q) \&\& (!P || !R) - 2 CNF because each or has 2 variables.
\end{itemize}
\subsection{kSAT}
\label{sec:org34e09bc}
Given an expression in KCNF is there an assignment of vars that makes it evaluate to true. \\
k = 2 (2SAT) \(\epsilon\) P \\
k > 2 \(\epsilon\) NP-Complete

\section{Graph Coloring}
\label{sec:orgfcf098a}
\begin{itemize}
\item Assign colors to nodes such that no two adjacent nodes have the same color
\item Is it possible to color a graph with t colors
\item if t=2 P, else if t > 2 NP-Complete
\item Finding the minimum chromatic number is NP-Hard
\end{itemize}

\section{Hamiltonian Paths / Cycles}
\label{sec:org2a75dfc}
\begin{itemize}
\item Given a graph is there a simple path (or cycle) that visits every vertex? Visit every single vertex once AND get back to the starting point.
\item NP-Complete
\end{itemize}
\subsection{k-SAT -> Hamiltonian Path}
\label{sec:org37d850f}
\begin{description}
\item[{E1}] (P || !Q) \&\&
\item[{E2}] (Q || R) \&\&
\item[{E3}] (!P || !R)
\item P, Q, R, craft the \emph{Hamburger of doom}
\item When you are checking, you must check if you can visit every node without repeating a path.
\item 2-SAT is P
\item Above is NP-Complete
\end{description}

\section{Euler Tour / Path}
\label{sec:orgbd87bc4}
\begin{itemize}
\item Use every edge once
\item Look at every verticie with an odd degree, if each one has an odd number of edges attached to it, then you will have an Euler Path. Just check for even or odd number of edges attached to the node.
\item P
\end{itemize}

\section{Traveling Salesman Problem}
\label{sec:org639ac7f}
\begin{itemize}
\item NP-Hard
\end{itemize}

\section{Bin Packing}
\label{sec:orgffe78f0}
\begin{itemize}
\item NP-Hard
\item Given a list of items \& bins of a standard size, what is the minimal number of bins needed to store the items?
\item For example, if you have a bunch of songs to burn and a fixed capacity for CDs how will you fit it in?
\end{itemize}

C = 10, S = [5, 6, 3, 7, 5, 4] \\
Best fit: 3 Bins
Opt(L): Optimal \# of bins

\subsection{Online}
\label{sec:org25a706d}
Items handled in order that they arrived in. The benefit is speed, so if it's a truck packing problem then the trucks can be sent out and not wait there.
\subsubsection{Next Fit}
\label{sec:org1137453}
\begin{itemize}
\item Next(L) \(\leq\) 2 * Opt(L) - 1
\end{itemize}
If the next item fits in the current bin, put it in there, if not, close the bin and open a new one.
\begin{center}
\begin{tabular}{ll}
Next Fit & \\
B1 & 5\\
B2 & 6, 3\\
B3 & 7\\
B4 & 5, 4\\
\end{tabular}
\end{center}
\subsubsection{Frist Fit}
\label{sec:org80a971a}
\begin{itemize}
\item First(l) \(\leq\) ceil(17/10 * Opt(L))
\end{itemize}
Keep bins open until full, put item in 1st bin it fits in
\begin{center}
\begin{tabular}{ll}
First Fit & \\
B1 & 5, 3\\
B2 & 6, 4\\
B3 & 7\\
B4 & 5\\
\end{tabular}
\end{center}

\subsection{Offline}
\label{sec:org9925803}
All items obtained and then fitted.
\subsubsection{First Fit Decreasing}
\label{sec:org438d60c}
\begin{itemize}
\item FFD(l) \(\leq\) ceil(11/9 * Opt(L))
\end{itemize}
Sort Items by decreasing size, then do first fit.
\begin{center}
\begin{tabular}{ll}
First Fit Decreasing & \\
B1 & 7, 3\\
B2 & 6, 4\\
B3 & 5, 5\\
\end{tabular}
\end{center}
\end{document}